---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.CheckPipeSystems
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.CheckPipeSystems

Verifies all pipe systems for properly connected pipes and valid system assignments.